%% точка запуску програми
%% Варіант 3
%% Схрещування: цеклове
%% Мутація: золотого перетину


% вхідні дані: матриця що описує граф для задачі комівояжера
%   * міста нумкруються від 1..N
%   * V>0 - вартість шляху
%   * V=M - нема шляху. якесь велике число

M = 1000;
graph = [ 
    M,  6,  4,  8,  7;
    6,  M,  7,  11, 7;
    4,  7,  M,  4,  3;
    8, 11,  7,  M,  5;
    7,  7,  3,  5,  M
];

% Задача: знайти найвигідніший маршрут,
% який проходить через кожне місто по одному разу

% одною особою є послідовність обходу міст
% значення генів не можуть повторюватися
% а довжина хромосоми рівна кількості міст

